{"pageProps":{"post":{"contentHTML":"<p>Bismillah, kali ini kita akan membahas mengenai alternatif software-software berbayar seperti Microsoft Office, CorelDraw, Adobe Photoshop dan Adobe Premier. Mungkin kamu pernah menggunakan software-software tersebut, atau bahkan kamu bekerja dengan menggunakan software-software tersebut. Kebanyakan, orang yang masih awam atau tidak terlalu paham akan teknologi, biasanya menggunakan software bajakan di laptop atau PC-nya, terutama yang menggunakan sistem operasi windows. Mungkin bagi yang masih awam, hal tersebut terjadi karena ketidaktahuan mereka, tetapi ada juga mereka yang paham akan teknologi dan tahu bahwa mereka menggunakan software bajakan, tetapi tetap menggunakannya. Alangkah baiknya jika menggunakan software berbayar, kita menggunakan versi originalnya, yaitu dengan membeli license dari software berbayar yang digunakan, apalagi bagi yang telah mendapatkan penghasilan dari software-software tersebut.</p>\n<p>Namun bagi yang tidak punya cukup uang untuk membeli licensenya, karena harganya memang cukup mahal, kamu bisa mencoba alternatifnya, yaitu software open source, software open source adalah software yang gratis kita gunakan, tanpa perlu membayar license, hanya saja jika dibandingkan dengan software berbayar, fiturnya tidak selengkap software berbayar, karena <strong>software berbayar memang ditujukan untuk orang-orang yang sudah profesional, yang memanfaatkan software-software tersebut untuk mencari uang</strong>. Tetapi fitur-fitur dari software open source sudah cukup untuk memenuhi kebutuahan kita, apalagi yang menggunakannya hanya untuk kebutuhan sehari-hari, seperti membuat tugas sekolah misalnya. Walaupun dengan fitur yang kalah jika dibandingkan dengan software berbayar, ada juga orang-orang yang sudah mendapatkan uang, dengan menggunakan software open source, menjadi youtuber misalnya, atau menjadi design grafis.</p>\n<p>Berikut beberapa software open source yang bisa menjadi alternatif dari software berbayar</p>\n<h2>LibreOffice</h2>\n<p>LibreOffice merupakan alternatif pertama dari Microsoft Office, di mana di website resminya dikatakan <em>LibreOffice is a free and powerful office suite</em> (LibreOffice adalah suite kantor gratis dan kuat). LibreOffice mendukung berbagai sistem operasi, mulai dari Linux, MacOS dan Windows jadi buat kamu yang tidak menggunakan operating sistem Windows, tidak perlu khawatir. Di LibreOffice ada LibreOffice Writer (alternatif Microsoft Office Word), LibreOffice Calc (alternatif Microsoft Office Excel), LibreOffice Impress (Alternatif Microsoft Office Power Point), dll. Saya pribadi kurang lebih sudah sekitar 4 bulan, menggunakan LibreOffice untuk membuat tugas kuliah, seperti makalah misalnya. Berikut tampilan dari LibreOffice Writer yang ada di laptop saya saat ini, dengan versi 7.0 :\n<img src=\"/posts/alternatif-software-berbayar/libreoffice-7.0.png\" alt=\"LibreOffice\" width=\"1366\" height=\"746\" loading=\"lazy\" decoding=\"async\"><!--rehype:width=1366&height=746&loading=lazy&decoding=async-->\nEkstensi file dari LibreOffice Writer ini adalah .odt berbeda dengan Microsoft Office Word yaitu biasanya .docx, file LibreOffice Write tidak bisa dibuka dengan Microsoft Office Word, jika kamu ingin print document di luar, yang mana rata-rata menggunakan Microsoft Office, kamu bisa menggunakan fitur export ke pdf, yang ada di LibreOffice. LibreOffice bisa kamu download pada website resminya di <a href=\"https://www.libreoffice.org/\">libreoffice.org</a>.</p>\n<h2>Google Apps</h2>\n<p>Di Google Apps selain YouTube, Google Transalate, ada juga Google Docs (alternatif Microsoft Office Word), Google Sheets (alternatif Microsoft Office Excel), dan Google Slides (alternatif Microsoft Office Power Point). Software-software tersebut bisa kamu gunakan secara gratis, bisa digunakan online maupun offline.</p>\n<blockquote>\n<p>Aplikasi yang ada di Google Apps bukan termasuk aplikasi open source, tetapi kita tetap bisa menggunakannya dengan gratis, dengan batasan tertentu.</p>\n</blockquote>\n<p>Untuk Google Docs salah satu fitur menariknya adalah kita bisa mengerjakan satu dokumen secara bersama-sama pada waktu yang sama. Kita juga tidak perlu menekan tombol simpan, semua akan otomatis disimpan saat kita mengetik. Dan juga kompatibel dengan Microsoft office Word, salah satunya kita bisa mengkonversikan file Google Dokumen ke file Word, atau sebaliknya, serta sudah ada starter template untuk resume, projek proposal, dll. Berikut tampilan dari Google Docs :\n<img src=\"/posts/alternatif-software-berbayar/googledocs.png\" alt=\"Google Docs\" width=\"1366\" height=\"746\" loading=\"lazy\" decoding=\"async\"><!--rehype:width=1366&height=746&loading=lazy&decoding=async--></p>\n<h2>Inkscape</h2>\n<p>Inkscape merupakan alternatif dari CorelDraw. Inkscape juga mendukung berbagai sistem operasi, mulai dari Linux, MacOS dan Windows. Inkscape bisa digunakan untuk membuat berbagai macam design, seperti logo, dll. Inkscape juga software yang cukup ringan dengan persyaratan sistem yang rendah, yaitu minimal 1 GHz processor, 512 MB RAM dan 500 MB penyimpanan. Meskipun software ini gratis digunakan, tetapi tidak kalah dengan software-software berbayar seperti CorelDraw. Inkscape bisa kamu download di website resminya di <a href=\"https://inkscape.org/\">inkscape.org</a>. Berikut tampilan dari Inkscape :\n<img src=\"/posts/alternatif-software-berbayar/inkscape.png\" alt=\"Inkscape\" width=\"1200\" height=\"675\" loading=\"lazy\" decoding=\"async\"><!--rehype:width=1200&height=675&loading=lazy&decoding=async--></p>\n<h2>GIMP</h2>\n<p>Gimp merupakan alternatif untuk Photoshop. Gimp juga mendukung berbagai sistem operasi, mulai dari Linux, MacOS dan Windows. Pada GIMP kita bisa manipulasi foto, membuat artwork, dll. GIMP juga merupakan software yang ringan, jadi tidak terlalu membutuhkan komputer dengan speksifikasi yang tinggi. GIMP bisa kamu download di website resminya di <a href=\"https://www.gimp.org/\">gimp.org</a>. Berikut tampilan dari GIMP :\n<img src=\"/posts/alternatif-software-berbayar/gimp.png\" alt=\"GIMP\" width=\"1366\" height=\"746\" loading=\"lazy\" decoding=\"async\"><!--rehype:width=1366&height=746&loading=lazy&decoding=async--></p>\n<h2>Kdenlive</h2>\n<p>Kdenlive merupakan software alternatif untuk Adobe Premiere, juga mendukung berbagai sistem operasi, mulai dari Linux, MacOS dan Windows. Kdenlive mendukung banyak Video dan Audio format, seperti H.264, Quick Time, dll. Kita juga bisa melakukan color correction untuk memperbaiki warna pada video. Walaupun software ini gratis digunakan, software ini memiliki fitur fitur yang lumayan, bahkan salah satu channel youtube seperti Indonesia Belajar misalnya, menggunakan kdenlive dalam mengedit videonya. Kdenlive bisa kamu download di website resminya di <a href=\"https://kdenlive.org/\">kdenlive.org</a>. Berikut tampilan dari Kdenlive :\n<img src=\"/posts/alternatif-software-berbayar/kdenlive.png\" alt=\"Kdenlive\" width=\"1920\" height=\"1080\" loading=\"lazy\" decoding=\"async\"><!--rehype:width=1920&height=1080&loading=lazy&decoding=async--></p>\n<p>Oke, terima kasih buat kamu yang sudah membaca, semoga bermanfaat. Jika ada yang ingin ditanyakan atau ada saran silahkan kirim email ke <a href=\"mailto:fikkri.reza@gmail.com\">fikkri.reza@gmail.com</a>. Jangan lupa follow twitter @RezaFikkri untuk mendapatkan tulisan terbaru.</p>","title":"Alternatif Software Berbayar","date":"2023-03-28T10:34:54.791Z","topics":["Software"],"slug":"alternatif-software-berbayar","ogImage":"/posts/alternatif-software-berbayar/alternatif-software-berbayar.png","excerpt":"Tetapi fitur-fitur dari software open source sudah cukup untuk memenuhi kebutuahan kita, apalagi yang menggunakannya hanya untuk kebutuhan sehari-hari"}},"__N_SSG":true}